### Dependents
***

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
stations = pd.read_csv('../hawaii_stations.csv')
measure = pd.read_csv('../hawaii_measurements.csv', parse_dates=['date'])

### Data Analysis and implementing fixes - Station Data
***

In [3]:
# Printing the data
stations

,station,name,latitude,longitude,elevation
0,USC00519397,"WAIKIKI 717.2, HI US",21.27160,-157.81680,3.0
1,USC00513117,"KANEOHE 838.1, HI US",21.42340,-157.80150,14.6
2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.52130,-157.83740,7.0
3,USC00517948,"PEARL CITY, HI US",21.39340,-157.97510,11.9
4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.49920,-158.01110,306.6
5,USC00519523,"WAIMANALO EXPERIMENTAL FARM, HI US",21.33556,-157.71139,19.5
6,USC00519281,"WAIHEE 837.5, HI US",21.45167,-157.84889,32.9
7,USC00511918,"HONOLULU OBSERVATORY 702.2, HI US",21.31520,-157.99920,0.9
8,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.33310,-157.80250,152.4

In [110]:
stations.dtypes

station       object
name          object
latitude     float64
longitude    float64
elevation    float64
dtype: object

In [4]:
# Note that the 'name' column is actually city, state, country and other
stations['name']

0                      WAIKIKI 717.2, HI US
1                      KANEOHE 838.1, HI US
2    KUALOA RANCH HEADQUARTERS 886.9, HI US
3                         PEARL CITY, HI US
4                UPPER WAHIAWA 874.3, HI US
5        WAIMANALO EXPERIMENTAL FARM, HI US
6                       WAIHEE 837.5, HI US
7         HONOLULU OBSERVATORY 702.2, HI US
8              MANOA LYON ARBO 785.2, HI US
Name: name, dtype: object

In [5]:
# Creating a lamba function to read each row and find the comma...then split the field
fix_comma = lambda x: pd.Series([i for i in reversed(x.split(','))])

In [6]:
# Applying the lamba function on each row
stat_info = stations['name'].apply(fix_comma)
print(stat_info)

        0                                1
0   HI US                    WAIKIKI 717.2
1   HI US                    KANEOHE 838.1
2   HI US  KUALOA RANCH HEADQUARTERS 886.9
3   HI US                       PEARL CITY
4   HI US              UPPER WAHIAWA 874.3
5   HI US      WAIMANALO EXPERIMENTAL FARM
6   HI US                     WAIHEE 837.5
7   HI US       HONOLULU OBSERVATORY 702.2
8   HI US            MANOA LYON ARBO 785.2

In [7]:
# Function created two columns 0 and 1. Note that column 0 created state and country
stat_info[0]

0     HI US
1     HI US
2     HI US
3     HI US
4     HI US
5     HI US
6     HI US
7     HI US
8     HI US
Name: 0, dtype: object

In [87]:
stat_info[1]

0                      WAIKIKI 717.2
1                      KANEOHE 838.1
2    KUALOA RANCH HEADQUARTERS 886.9
3                         PEARL CITY
4                UPPER WAHIAWA 874.3
5        WAIMANALO EXPERIMENTAL FARM
6                       WAIHEE 837.5
7         HONOLULU OBSERVATORY 702.2
8              MANOA LYON ARBO 785.2
Name: 1, dtype: object

In [88]:
# Creating another lamba function to find spaces and split the each value
fix_space_0 = lambda x: pd.Series([i for i in reversed(x.split(' '))])

In [89]:
# Apply new function to the column entries
stat_info_st = stat_info[0].apply(fix_space_0)
print(stat_info_st)

    0   1 2
0  US  HI
1  US  HI
2  US  HI
3  US  HI
4  US  HI
5  US  HI
6  US  HI
7  US  HI
8  US  HI

In [90]:
stat_info_st[[0,1]]

    0   1
0  US  HI
1  US  HI
2  US  HI
3  US  HI
4  US  HI
5  US  HI
6  US  HI
7  US  HI
8  US  HI

In [91]:
# Concatenating the two pd.series
stat_info_merge = pd.concat([stat_info[1], stat_info_st[[0,1]]], axis=1)

In [92]:
stat_info_merge

                                 1   0   1
0                    WAIKIKI 717.2  US  HI
1                    KANEOHE 838.1  US  HI
2  KUALOA RANCH HEADQUARTERS 886.9  US  HI
3                       PEARL CITY  US  HI
4              UPPER WAHIAWA 874.3  US  HI
5      WAIMANALO EXPERIMENTAL FARM  US  HI
6                     WAIHEE 837.5  US  HI
7       HONOLULU OBSERVATORY 702.2  US  HI
8            MANOA LYON ARBO 785.2  US  HI

In [93]:
# Concatenating the two pd.series with a pd.DataFrame
clean_stations = pd.concat([stations, stat_info_merge], axis=1)

In [94]:
clean_stations

,station,name,latitude,longitude,elevation,1,0,1
0,USC00519397,"WAIKIKI 717.2, HI US",21.27160,-157.81680,3.0,WAIKIKI 717.2,US,HI
1,USC00513117,"KANEOHE 838.1, HI US",21.42340,-157.80150,14.6,KANEOHE 838.1,US,HI
2,USC00514830,"KUALOA RANCH HEADQUARTERS 886.9, HI US",21.52130,-157.83740,7.0,KUALOA RANCH HEADQUARTERS 886.9,US,HI
3,USC00517948,"PEARL CITY, HI US",21.39340,-157.97510,11.9,PEARL CITY,US,HI
4,USC00518838,"UPPER WAHIAWA 874.3, HI US",21.49920,-158.01110,306.6,UPPER WAHIAWA 874.3,US,HI
5,USC00519523,"WAIMANALO EXPERIMENTAL FARM, HI US",21.33556,-157.71139,19.5,WAIMANALO EXPERIMENTAL FARM,US,HI
6,USC00519281,"WAIHEE 837.5, HI US",21.45167,-157.84889,32.9,WAIHEE 837.5,US,HI
7,USC00511918,"HONOLULU OBSERVATORY 702.2, HI US",21.31520,-157.99920,0.9,HONOLULU OBSERVATORY 702.2,US,HI
8,USC00516128,"MANOA LYON ARBO 785.2, HI US",21.33310,-157.80250,152.4,MANOA LYON ARBO 785.2,US,HI

In [105]:
clean_stations.drop(['name'], axis=1, inplace=True)

In [106]:
# Neat way to rename columns and order appropriately
clean_stations.columns = ['station', 'latitude', 'longitude', 'elevation', 'name', 'country', 'state']

In [107]:
# Finished clean df
clean_stations

,station,latitude,longitude,elevation,name,country,state
0,USC00519397,21.27160,-157.81680,3.0,WAIKIKI 717.2,US,HI
1,USC00513117,21.42340,-157.80150,14.6,KANEOHE 838.1,US,HI
2,USC00514830,21.52130,-157.83740,7.0,KUALOA RANCH HEADQUARTERS 886.9,US,HI
3,USC00517948,21.39340,-157.97510,11.9,PEARL CITY,US,HI
4,USC00518838,21.49920,-158.01110,306.6,UPPER WAHIAWA 874.3,US,HI
5,USC00519523,21.33556,-157.71139,19.5,WAIMANALO EXPERIMENTAL FARM,US,HI
6,USC00519281,21.45167,-157.84889,32.9,WAIHEE 837.5,US,HI
7,USC00511918,21.31520,-157.99920,0.9,HONOLULU OBSERVATORY 702.2,US,HI
8,USC00516128,21.33310,-157.80250,152.4,MANOA LYON ARBO 785.2,US,HI

In [108]:
clean_stations.to_csv('../clean_stations.csv', index=False)

### Data Analysis and implementing fixes - Measurement Data
***

In [20]:
measure.head()

       station       date  prcp  tobs
0  USC00519397 2010-01-01  0.08    65
1  USC00519397 2010-01-02  0.00    63
2  USC00519397 2010-01-03  0.00    74
3  USC00519397 2010-01-04  0.00    76
4  USC00519397 2010-01-06   NaN    73

In [21]:
measure.tail()

           station       date  prcp  tobs
19545  USC00516128 2017-08-19  0.09    71
19546  USC00516128 2017-08-20   NaN    78
19547  USC00516128 2017-08-21  0.56    76
19548  USC00516128 2017-08-22  0.50    76
19549  USC00516128 2017-08-23  0.45    76

In [123]:
measure.columns = ['station', 'date', 'precip', 'tobs']

In [124]:
measure.dtypes

station            object
date       datetime64[ns]
precip            float64
tobs                int64
dtype: object

In [125]:
measure.describe()

             precip          tobs
count  18103.000000  19550.000000
mean       0.160644     73.097954
std        0.468746      4.523527
min        0.000000     53.000000
25%        0.000000     70.000000
50%        0.010000     73.000000
75%        0.110000     76.000000
max       11.530000     87.000000

In [126]:
# Info method shows the number of NaN records - more than 1400
# PD.read_csv command - parse_dates was used to convert date raw date into datetime format
measure.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
station    19550 non-null object
date       19550 non-null datetime64[ns]
precip     18103 non-null float64
tobs       19550 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 611.0+ KB

In [127]:
# Creating a df of just the nullse
measure_nan = measure[measure.isnull().any(axis=1)]

In [128]:
# Counting the number of null values
measure_nan.count()

station    1447
date       1447
precip        0
tobs       1447
dtype: int64

In [130]:
# Before replacing nulls with zero determine if a group of years has more or less nulls
measure_val_2010_to_2013 = measure_nan[(measure_nan['date'] > '2010-1-1') & (measure_nan['date'] <= '2013-12-31')]

In [131]:
measure_val_2010_to_2013.count()

station    637
date       637
precip       0
tobs       637
dtype: int64

In [132]:
measure_val_2014_to_2017 = measure_nan[(measure_nan['date'] > '2014-1-1') & (measure_nan['date'] <= '2017-12-31')]

In [133]:
# This analysis shows that there are more nulls in last four years
measure_val_2014_to_2017.count()

station    810
date       810
precip       0
tobs       810
dtype: int64

In [134]:
# Determine count per year to see what distribution of nulls looks like
measure_val_1_2010_to_12_2010 = measure_nan[(measure_nan['date'] > '2010-1-1') & (measure_nan['date'] <= '2010-12-31')]
measure_val_1_2011_to_12_2011 = measure_nan[(measure_nan['date'] > '2011-1-1') & (measure_nan['date'] <= '2011-12-31')]
measure_val_1_2012_to_12_2012 = measure_nan[(measure_nan['date'] > '2012-1-1') & (measure_nan['date'] <= '2012-12-31')]
measure_val_1_2013_to_12_2013 = measure_nan[(measure_nan['date'] > '2013-1-1') & (measure_nan['date'] <= '2013-12-31')]
measure_val_1_2014_to_12_2014 = measure_nan[(measure_nan['date'] > '2014-1-1') & (measure_nan['date'] <= '2014-12-31')]
measure_val_1_2015_to_12_2015 = measure_nan[(measure_nan['date'] > '2015-1-1') & (measure_nan['date'] <= '2015-12-31')]
measure_val_1_2016_to_12_2016 = measure_nan[(measure_nan['date'] > '2016-1-1') & (measure_nan['date'] <= '2016-12-31')]
measure_val_1_2017_to_12_2017 = measure_nan[(measure_nan['date'] > '2017-1-1') & (measure_nan['date'] <= '2017-12-31')]

In [135]:
count_2010 = measure_val_1_2010_to_12_2010.count()
count_2011 = measure_val_1_2011_to_12_2011.count()
count_2012 = measure_val_1_2012_to_12_2012.count()
count_2013 = measure_val_1_2013_to_12_2013.count()
count_2014 = measure_val_1_2014_to_12_2014.count()
count_2015 = measure_val_1_2015_to_12_2015.count()
count_2016 = measure_val_1_2016_to_12_2016.count()
count_2017 = measure_val_1_2017_to_12_2017.count()

In [136]:
# 2010 and 2017 data shows the least number of null values
print(count_2010, count_2011, count_2012, count_2013, count_2014, count_2015, count_2016, count_2017)

station    103
date       103
precip       0
tobs       103
dtype: int64 station    168
date       168
precip       0
tobs       168
dtype: int64 station    170
date       170
precip       0
tobs       170
dtype: int64 station    196
date       196
precip       0
tobs       196
dtype: int64 station    195
date       195
precip       0
tobs       195
dtype: int64 station    244
date       244
precip       0
tobs       244
dtype: int64 station    240
date       240
precip       0
tobs       240
dtype: int64 station    129
date       129
precip       0
tobs       129
dtype: int64

In [137]:
# Replacing nulls with 0.
clean_measure = measure.fillna(0)

In [138]:
clean_measure.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19550 entries, 0 to 19549
Data columns (total 4 columns):
station    19550 non-null object
date       19550 non-null datetime64[ns]
precip     19550 non-null float64
tobs       19550 non-null int64
dtypes: datetime64[ns](1), float64(1), int64(1), object(1)
memory usage: 611.0+ KB

In [141]:
clean_measure.to_csv('../clean_measure.csv', index=False)